posts/python-ide-with-emacs-and-docker/index.org
#+BEGIN_COMMENT
.. title: Building a Python IDE with Emacs and Docker
.. slug: python-ide-with-emacs-and-docker
.. date: 2020-03-03 07:19:45 UTC+02:00
.. tags: Python, IDE, Emacs, Docker, Dockerfile, ssh
.. category: Emacs
.. link:
.. description:
.. type: text

#+END_COMMENT
* Prologue
  I am a fan of [[https://en.wikipedia.org/wiki/Windows_Subsystem_for_Linux][=Windows Subsystem for Linux=]]. It brings the power of Linux command-line tools to Windows which is something a developer cannot dislike but that isn't the main reason I'm fond of it. I like it because it allows me to run Emacs (albeit in console mode) at its full potential.

  As a side-note, on my personal laptop I use Emacs on Ubuntu whereas on the work laptop I use Emacs from Cygwin. And although Cygwin does a great job in providing the powerful Linux tools on Windows, some of them are really slow compared to the native ones. An example of such a tool is =git=. I heavily use [[https://magit.vc/manual/magit][=Magit=]] for a lot of my projects but working with it in Emacs on Cygwin is a real pain. Waiting for a simple operation to finish knowing that the same operation completes instantly on Linux is exhausting. Thus, in order to avoid such unpleasant experience whenever I would need to use Magit I would use it from Emacs in =Ubuntu Bash on Windows=.

  Furthermore, I use =Ubuntu Bash on Windows= to work on my Python projects simply because I can do everything from within Emacs there --- from editing input files in =csv-mode=, to writing code using =elpy= with =jedi= and pushing the code to a GitHub repo using =magit=.

  All was good until an update for Windows [[https://github.com/microsoft/terminal/issues/210][messed up the console output on =WSL=]] which rendered both my Python setup and Emacs unusable. And if that wasn't bad enough, I got affected by this issue before a verry important deadline for one of the Python projects.

  Faced with the fact that there nothing I could do at that moment to fix the console output and in desperate need for a solution, I asked myself:
  #+begin_quote
  Can't I create the same setup as in =WSL= using =Docker=?
  #+end_quote
  The answer is *Yes*. If you want to see only the final =Dockerfile=, head directly to the [[#tldr][*TL;DR*]] section. Otherwise, please read along. In any case --- thanks for reading!
* How
  Since I already have been using Emacs as a Python IDE in Ubuntu Bash, replicating this setup in Docker would imply:
  1. Providing remote access via =ssh= to the container and
  2. Installing the same packages for both the OS and Emacs.

  I already knew more or less how to do the later (or so I thought) so obviously I started with the former: ssh access to a Docker container.

  Luckily, Docker already has an [[https://docs.docker.com/engine/examples/running_ssh_service/][example of running =ssh= service]] so I started with the Dockerfile provided there. I copied the instructions into a local Dockerfile, built the image and ran the container. But when I tried to connect to the container I ran into the first issue addressed in this post:
* Issue #1: SSHD refuses connection
  This one was easy --- there's a typo in the example provided by Docker. I figured it out after inspecting the contents of =sshd_config= file.

  After a while I noticed that the line containing =PermitRootlogin= was commented-out and thus =sed= wasn't able to match the pattern and failed to replace the permission.

  Since I was connecting as =root= the =sshd= refused connection.

  The fix for this is to include the =#= in the call to =sed= as below:
  #+begin_src sh
    RUN sed -i 's/#PermitRootLogin prohibit-password/PermitRootLogin yes/' /etc/ssh/sshd_config
  #+end_src

  Having done the change, I rebuilt the image and started the container. As the tutorial mentioned, I ran in console =docker port <container-name> 22=. This command gave me the port on which to connect so I ran =ssh root@localhost -p <port>=.

  Success.

  Even though the =sshd= was running and accepting connections, the fact that the root password was hardcoded in plain text /really/ bothered me so I made a small tweak to the =Dockerfile=:
  #+begin_src sh
    ARG password

    RUN echo "root:${password}" | chpasswd
  #+end_src
  What this does is it declares a variable =password= whose value is supplied when building the image like this:
  #+begin_src sh
    docker build -t <image-tag> \
	   --build-arg password=<your-password-here> \
	   .
  #+end_src
  This way, the root password isn't stored in clear text and in plain-sight anymore. Now I was ready to move to the next step.
