posts/python-ide-with-emacs-and-docker/index.html
<!DOCTYPE html>
<html prefix="
" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>Rebeja · Building a Python IDE with Emacs and Docker </title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="http://fonts.googleapis.com/css?family=PT+Sans:400,400italic,700|Abril+Fatface">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/fork-awesome@1.1.7/css/fork-awesome.min.css" integrity="sha256-gsmEoJAws/Kd3CjuOQzLie5Q3yshhvmo7YNtBG7aaEY=" crossorigin="anonymous">
<meta content="#5670d4" name="theme-color">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://rebeja.eu/posts/python-ide-with-emacs-and-docker/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Petru Rebeja">
<link rel="prev" href="../declutter-the-way-of-working/" title="Declutter the way of working" type="text/html">
<link rel="next" href="../separate-tools-from-domain/" title="Keep the tools separate from the domain of your application" type="text/html">
</head>
<body class="">
    <a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>
    <div class="hsidebar">
        <div class="container sidebar-sticky">
                <nav id="menu" role="navigation" class="sidebar-nav"><a class="sidebar-nav-item" href="../../index.html" title="Home"><i class="fa fa-home"></i>Home</a>
            <a class="sidebar-nav-item" href="../../archive.html" title="Archive"><i class="fa fa-folder-open"></i>Archive</a>
            <a class="sidebar-nav-item" href="../../categories/index.html" title="Tags"><i class="fa fa-tags"></i>Tags</a>
            <a class="sidebar-nav-item" href="../../pages/welcome/" title="About"><i class="fa fa-user"></i>About</a>
            <a class="sidebar-nav-item" href="../../tehnologii-web/" title="Teaching"><i class="fa fa-graduation-cap"></i>Teaching</a>
            <a class="sidebar-nav-item" href="../../pages/en-ro-dictionary-for-ai" title="EN-RO 4 AI"><i class="fa fa-book"></i>EN-RO 4 AI</a>
            <a class="sidebar-nav-item" href="../../rss.xml" title="RSS"><i class="fa fa-feed"></i>RSS</a>
    
    
    </nav><footer id="footer"><span class="copyright">
              Contents © 2025         <a href="mailto:petru.rebeja@gmail.com">Petru Rebeja</a> - Powered by   <a href="https://www.gnu.org/software/emacs/" rel="nofollow">GNU Emacs</a>  &amp;    <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            </span>
            
            
        </footer>
</div>
    </div>
    <div class="content container" id="content">
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><h1 class="post-title p-name"><a href="." class="u-url">Building a Python IDE with Emacs and Docker</a></h1>

    <p class="dateline">
      <i class="fa fa-clock-o"></i> <time class="published dt-published" datetime="2020-03-03T07:19:45+02:00" itemprop="datePublished" title="2020-03-03 07:19">2020-03-03 07:19</time>   |   <i class="fa fa-user"></i> 
         Petru Rebeja
      
      
    </p>
    

    <div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-orgbe84892" class="outline-2">
<h2 id="orgbe84892">Prologue</h2>
<div class="outline-text-2" id="text-orgbe84892">
<p>
I am a fan of <a href="https://en.wikipedia.org/wiki/Windows_Subsystem_for_Linux"><code>Windows Subsystem for Linux</code></a>. It brings the power of Linux command-line tools to Windows which is something a developer cannot dislike but that isn't the main reason I'm fond of it. I like it because it allows me to run Emacs (albeit in console mode) at its full potential.
</p>

<p>
As a side-note, on my personal laptop I use Emacs on Ubuntu whereas on the work laptop I use Emacs from Cygwin. And although Cygwin does a great job in providing the powerful Linux tools on Windows, some of them are really slow compared to the native ones. An example of such a tool is <code>git</code>. I heavily use <a href="https://magit.vc/manual/magit"><code>Magit</code></a> for a lot of my projects but working with it in Emacs on Cygwin is a real pain. Waiting for a simple operation to finish knowing that the same operation completes instantly on Linux is exhausting. Thus, in order to avoid such unpleasant experience whenever I would need to use Magit I would use it from Emacs in <code>Ubuntu Bash on Windows</code>.
</p>

<p>
Furthermore, I use <code>Ubuntu Bash on Windows</code> to work on my Python projects simply because I can do everything from within Emacs there — from editing input files in <code>csv-mode</code>, to writing code using <code>elpy</code> with <code>jedi</code> and pushing the code to a GitHub repo using <code>magit</code>.
</p>

<p>
All was good until an update for Windows <a href="https://github.com/microsoft/terminal/issues/210">messed up the console output on <code>WSL</code></a> which rendered both my Python setup and Emacs unusable. And if that wasn't bad enough, I got affected by this issue before a very important deadline for one of the Python projects.
</p>

<p>
Faced with the fact that there nothing I could do at that moment to fix the console output and in desperate need for a solution, I asked myself:
</p>
<blockquote>
<p>
Can't I create the same setup as in <code>WSL</code> using <code>Docker</code>?
</p>
</blockquote>
<p>
The answer is <b>Yes</b>. If you want to see only the final <code>Dockerfile</code>, head directly to the <a href="#tldr"><b>TL;DR</b></a> section. Otherwise, please read along. In any case — thanks for reading!
</p>
</div>
</div>
<div id="outline-container-org412b0e6" class="outline-2">
<h2 id="org412b0e6">How</h2>
<div class="outline-text-2" id="text-org412b0e6">
<p>
Since I already have been using Emacs as a Python IDE in Ubuntu Bash, replicating this setup in Docker would imply:
</p>
<ol class="org-ol">
<li>Providing remote access via <code>ssh</code> to the container and</li>
<li>Installing the same packages for both the OS and Emacs.</li>
</ol>
<p>
I already knew more or less how to do the later (or so I thought) so obviously I started with the former: ssh access to a Docker container.
</p>

<p>
Luckily, Docker already has an <a href="https://docs.docker.com/engine/examples/running_ssh_service/">example of running <code>ssh</code> service</a> so I started with the Dockerfile provided there. I copied the instructions into a local Dockerfile, built the image and ran the container. But when I tried to connect to the container I ran into the first issue addressed in this post:
</p>
</div>
</div>
<div id="outline-container-orgb1392e2" class="outline-2">
<h2 id="orgb1392e2">Issue #1: SSHD refuses connection</h2>
<div class="outline-text-2" id="text-orgb1392e2">
<p>
This one was easy — there's a typo in the example provided by Docker. I figured it out after inspecting the contents of <code>sshd_config</code> file.
</p>

<p>
After a while I noticed that the line containing <code>PermitRootlogin</code> was commented-out and thus <code>sed</code> wasn't able to match the pattern and failed to replace the permission.
</p>

<p>
Since I was connecting as <code>root</code> the <code>sshd</code> refused connection.
</p>

<p>
The fix for this is to include the <code>#</code> in the call to <code>sed</code> as below:
</p>
<div class="highlight"><pre><span></span><span class="w">  </span>RUN<span class="w"> </span>sed<span class="w"> </span>-i<span class="w"> </span><span class="s1">'s/#PermitRootLogin prohibit-password/PermitRootLogin yes/'</span><span class="w"> </span>/etc/ssh/sshd_config
</pre></div>

<p>
Having done the change, I rebuilt the image and started the container. As the tutorial mentioned, I ran in console <code>docker port &lt;container-name&gt; 22</code>. This command gave me the port on which to connect so I ran <code>ssh root@localhost -p &lt;port&gt;</code>.
</p>

<p>
Success.
</p>

<p>
Even though the <code>sshd</code> was running and accepting connections, the fact that the root password was hard-coded in plain text <i>really</i> bothered me so I made a small tweak to the <code>Dockerfile</code>:
</p>
<div class="highlight"><pre><span></span><span class="w">  </span>ARG<span class="w"> </span>password

<span class="w">  </span>RUN<span class="w"> </span><span class="nb">echo</span><span class="w"> </span><span class="s2">"root:</span><span class="si">${</span><span class="nv">password</span><span class="si">}</span><span class="s2">"</span><span class="w"> </span><span class="p">|</span><span class="w"> </span>chpasswd
</pre></div>
<p>
What this does is it declares a variable <code>password</code> whose value is supplied when building the image like this:
</p>
<div class="highlight"><pre><span></span><span class="w">  </span>docker<span class="w"> </span>build<span class="w"> </span>-t<span class="w"> </span>&lt;image-tag&gt;<span class="w"> </span><span class="se">\</span>
<span class="w">         </span>--build-arg<span class="w"> </span><span class="nv">password</span><span class="o">=</span>&lt;your-password-here&gt;<span class="w"> </span><span class="se">\</span>
<span class="w">         </span>.
</pre></div>
<p>
This way, the root password isn't stored in clear text and in plain-sight anymore. Now I was ready to move to the next step.
</p>
</div>
</div>
