posts/python-ide-with-emacs-and-docker/index.org
* Issue #2: Activating virtual environment inside container
  The second item of my quest was to setup and activate a Python virtual environment. This environment will be used to install all the dependencies required for the project I'm working on.

  Also, this environment will be used by Emacs and =elpy= to provide the features of an IDE.

  A this point I asked myself: do I actually need a virtual environment? The Ubuntu Docker image comes with Python preinstalled so why not install the dependencies system-wide? After all, Docker containers and images are somewhat disposable --- I can alwasy recreate the image and start a new container for another project.

  I decided I /need/ a virtual environment because otherwise things would get messy and I like well organized stuff.

  So I started looking out how to setup and activate a virtual environment inside a Docker container. And by looking up I mean googling it or, in my case --- googling it with Bing.

  I got lucky since one of the first results was the article that led to my solution: [[https://pythonspeed.com/articles/activate-virtualenv-dockerfile/][Elegantly activating a virtualenv in a Dockerfile]]. It has a great explanation of what needs to be done and what's going under the hood when activating a virtual environment.

  The changes pertaining to my config are the following:
  #+begin_src sh
    ENV VIRTUAL_ENV=/opt/venv
    RUN python3 -m virtualenv --python=/usr/bin/python3 $VIRTUAL_ENV
    ENV PATH="$VIRTUAL_ENV/bin:$PATH"
    RUN pip install --upgrade pip setuptools wheel && \
	pip install numpy tensorflow scikit-learn gensim matplotlib pyyaml matplotlib-venn && \
	pip install elpy jedi rope yapf importmagic flake8 autopep8 black
  #+end_src

  As described in the article linked above, activating a Python virtual environment in its essence is just setting some environment variables.

  What the solution above does is to define where the virtual environment will be created and store it into the =VIRTUAL_ENV= variable. Next, create the environment at the specified path using =python3 -m virtualenv $VIRTUAL_ENV=. The =--python=/usr/bin/python3= argument just makes sure that the python interpreter to use is indeed =python3=.

  Activating the virtual environment means just prepending its =bin= directory to the =PATH= variable: ~ENV PATH="$VIRTUAL_ENV/bin:$PATH"~.

  Afterwards, just install the required packages as usual.
