posts/python-ide-with-emacs-and-docker/index.html
<div id="outline-container-orgfdb6593" class="outline-2">
<h2 id="orgfdb6593">Issue #2: Activating virtual environment inside container</h2>
<div class="outline-text-2" id="text-orgfdb6593">
<p>
The second item of my quest was to setup and activate a Python virtual environment. This environment will be used to install all the dependencies required for the project I'm working on.
</p>

<p>
Also, this environment will be used by Emacs and <code>elpy</code> to provide the features of an IDE.
</p>

<p>
A this point I asked myself: do I actually need a virtual environment? The Ubuntu Docker image comes with Python preinstalled so why not install the dependencies system-wide? After all, Docker containers and images are somewhat disposable — I can always recreate the image and start a new container for another project.
</p>

<p>
I decided I <i>need</i> a virtual environment because otherwise things would get messy and I like well organized stuff.
</p>

<p>
So I started looking out how to setup and activate a virtual environment inside a Docker container. And by looking up I mean googling it or, in my case — googling it with Bing.
</p>

<p>
I got lucky since one of the first results was the article that led to my solution: <a href="https://pythonspeed.com/articles/activate-virtualenv-dockerfile/">Elegantly activating a virtualenv in a Dockerfile</a>. It has a great explanation of what needs to be done and what's going under the hood when activating a virtual environment.
</p>

<p>
The changes pertaining to my config are the following:
</p>
<div class="highlight"><pre><span></span><span class="w">  </span>ENV<span class="w"> </span><span class="nv">VIRTUAL_ENV</span><span class="o">=</span>/opt/venv
<span class="w">  </span>RUN<span class="w"> </span>python3<span class="w"> </span>-m<span class="w"> </span>virtualenv<span class="w"> </span>--python<span class="o">=</span>/usr/bin/python3<span class="w"> </span><span class="nv">$VIRTUAL_ENV</span>
<span class="w">  </span>ENV<span class="w"> </span><span class="nv">PATH</span><span class="o">=</span><span class="s2">"</span><span class="nv">$VIRTUAL_ENV</span><span class="s2">/bin:</span><span class="nv">$PATH</span><span class="s2">"</span>
<span class="w">  </span>RUN<span class="w"> </span>pip<span class="w"> </span>install<span class="w"> </span>--upgrade<span class="w"> </span>pip<span class="w"> </span>setuptools<span class="w"> </span>wheel<span class="w"> </span><span class="o">&amp;&amp;</span><span class="w"> </span><span class="se">\</span>
<span class="w">      </span>pip<span class="w"> </span>install<span class="w"> </span>numpy<span class="w"> </span>tensorflow<span class="w"> </span>scikit-learn<span class="w"> </span>gensim<span class="w"> </span>matplotlib<span class="w"> </span>pyyaml<span class="w"> </span>matplotlib-venn<span class="w"> </span><span class="o">&amp;&amp;</span><span class="w"> </span><span class="se">\</span>
<span class="w">      </span>pip<span class="w"> </span>install<span class="w"> </span>elpy<span class="w"> </span>jedi<span class="w"> </span>rope<span class="w"> </span>yapf<span class="w"> </span>importmagic<span class="w"> </span>flake8<span class="w"> </span>autopep8<span class="w"> </span>black
</pre></div>

<p>
As described in the article linked above, activating a Python virtual environment in its essence is just setting some environment variables.
</p>

<p>
What the solution above does is to define where the virtual environment will be created and store it into the <code>VIRTUAL_ENV</code> variable. Next, create the environment at the specified path using <code>python3 -m virtualenv $VIRTUAL_ENV</code>. The <code>--python=/usr/bin/python3</code> argument just makes sure that the python interpreter to use is indeed <code>python3</code>.
</p>

<p>
Activating the virtual environment means just prepending its <code>bin</code> directory to the <code>PATH</code> variable: <code>ENV PATH="$VIRTUAL_ENV/bin:$PATH"</code>.
</p>

<p>
Afterwards, just install the required packages as usual.
</p>
</div>
</div>
