posts/python-ide-with-emacs-and-docker/index.html
<div id="outline-container-orgc86ece8" class="outline-2">
<h2 id="orgc86ece8">Issue #3: Emacs monolithic configuration file</h2>
<div class="outline-text-2" id="text-orgc86ece8">
<p>
After setting up and activating the virtual environment, I needed to configure Emacs for python development to start working.
</p>

<p>
Luckily, I have my Emacs (semi-literate) config script in a <a href="https://github.com/repierre/.emacs.d">GitHub repository</a> and all I need to do is jut clone the repo locally and everything should work. Or so I thought.
</p>

<p>
I cloned the repository containing my config, which at that time was just a single file <code>emacs-init.org</code> bootstrapped by <code>init.el</code>, logged into the container and started Emacs.
</p>

<p>
After waiting for all the packages to install I was greeted by a plethora of errors and warnings: some packages were failing to install due to being incompatible with the Emacs version installed in the container, some weren't properly configured to run in console and so on and so forth.
</p>

<p>
Not willing to spend a lot of time on this (I had a deadline after all) I decided to take a shortcut: why don't I just split the configuration file such that I would be able to only activate packages related to Python development? After all, the sole purpose of this image is to have a setup where I can do some Python development the way I'm used to. Fortunately, this proved to be a good decision.
</p>

<p>
So I split my <code>emacs-init.org</code> file into four files: one file for tweaks and packages that I want to have everywhere, one file for <code>org-mode</code> related stuff, one file for Python development and lastly one file for tweaks and packages that I would like when I'm using Emacs GUI. The <code>init.el</code> file looked like this:
</p>
<div class="highlight"><pre><span></span><span class="p">(</span><span class="nf">require</span><span class="w"> </span><span class="ss">'package</span><span class="p">)</span>

<span class="p">(</span><span class="nf">package-initialize</span><span class="p">)</span>

<span class="p">(</span><span class="nf">org-babel-load-file</span><span class="w"> </span><span class="p">(</span><span class="nf">expand-file-name</span><span class="w"> </span><span class="s">"~/.emacs.d/common-config.org"</span><span class="p">))</span>
<span class="p">(</span><span class="nf">org-babel-load-file</span><span class="w"> </span><span class="p">(</span><span class="nf">expand-file-name</span><span class="w"> </span><span class="s">"~/.emacs.d/python-config.org"</span><span class="p">))</span>
<span class="p">(</span><span class="nf">org-babel-load-file</span><span class="w"> </span><span class="p">(</span><span class="nf">expand-file-name</span><span class="w"> </span><span class="s">"~/.emacs.d/org-config.org"</span><span class="p">))</span>
<span class="p">(</span><span class="nf">org-babel-load-file</span><span class="w"> </span><span class="p">(</span><span class="nf">expand-file-name</span><span class="w"> </span><span class="s">"~/.emacs.d/emacs-init.org"</span><span class="p">))</span>
</pre></div>

<p>
Now I can use <code>sed</code> on the <code>init.el</code> file to delete the lines that were loading troublesome packages:
</p>
<div class="highlight"><pre><span></span>sed<span class="w"> </span>-i<span class="w"> </span><span class="s1">'/^.*emacs-init.*$/d'</span><span class="w"> </span>./.emacs.d/init.el<span class="w"> </span><span class="o">&amp;&amp;</span><span class="w"> </span><span class="se">\</span>
sed<span class="w"> </span>-i<span class="w"> </span><span class="s1">'/^.*org-config.*$/d'</span><span class="w"> </span>./.emacs.d/init.el
</pre></div>

<p>
After starting a container from the new image I started getting some odd errors about failing to verify package signature. Again, googling the error message with Bing got me a quick-fix: <a href="https://emacs.stackexchange.com/a/53142/14110"><code>(setq package-check-signature nil)</code></a>. This fix is actually a security risk but since it would be applied to an isolated environment I didn't bother looking for a better way.
</p>

<p>
However, another problem arose — how can I apply this fix without committing it to the GitHub repository?
</p>

<p>
Looking back at how I used <code>sed</code> to remove some lines from <code>init.el</code> file one of the first ideas that popped into my head was to replace an empty line from <code>init.el</code> with the quick-fix, but after giving it some more thought I decided to use a more general solution that involves a little bit of (over) engineering.
</p>

<p>
Since I'm interested in altering Emacs behavior before installing packages it would be good to have a way to inject more Lisp code than a single line. Furthermore, in cases where such code consists of multiple lines I could just add it using Dockers' <code>ADD</code> command instead of turning into a maintenance nightmare with multiple <code>sed</code> calls.
</p>

<p>
Don't get me wrong: <code>sed</code> is great but I prefer to have large chunks of code in a separate file without the added complexity of them being intertwined with <code>sed</code> calls.
</p>

<p>
The solution to this problem is quite simple: before loading configuration files, check if a specific file exists; in my case it would be <code>config.el</code> (not a descriptive name, I know) located in <code>.emacs.d</code> directory. If file exists load it. Afterwards load the known configuration files. And since we're doing this, why not do the same for after loading the known configuration files?
</p>

<p>
Thus, the resulting <code>init.el</code> looks like this (I promise to fix those names sometimes):
</p>
<div class="highlight"><pre><span></span><span class="w">  </span><span class="p">(</span><span class="nf">require</span><span class="w"> </span><span class="ss">'package</span><span class="p">)</span>

<span class="w">  </span><span class="p">(</span><span class="nf">package-initialize</span><span class="p">)</span>

<span class="w">  </span><span class="p">(</span><span class="k">let</span><span class="w"> </span><span class="p">((</span><span class="nf">file-name</span><span class="w"> </span><span class="p">(</span><span class="nf">expand-file-name</span><span class="w"> </span><span class="s">"config.el"</span><span class="w"> </span><span class="nv">user-emacs-directory</span><span class="p">)))</span>
<span class="w">    </span><span class="p">(</span><span class="k">if</span><span class="w"> </span><span class="p">(</span><span class="nf">file-exists-p</span><span class="w"> </span><span class="nv">file-name</span><span class="p">)</span>
<span class="w">        </span><span class="p">(</span><span class="nf">load-file</span><span class="w"> </span><span class="nv">file-name</span><span class="p">)))</span>

<span class="w">  </span><span class="p">(</span><span class="nf">org-babel-load-file</span><span class="w"> </span><span class="p">(</span><span class="nf">expand-file-name</span><span class="w"> </span><span class="s">"~/.emacs.d/common-config.org"</span><span class="p">))</span>
<span class="w">  </span><span class="p">(</span><span class="nf">org-babel-load-file</span><span class="w"> </span><span class="p">(</span><span class="nf">expand-file-name</span><span class="w"> </span><span class="s">"~/.emacs.d/python-config.org"</span><span class="p">))</span>
<span class="w">  </span><span class="p">(</span><span class="nf">org-babel-load-file</span><span class="w"> </span><span class="p">(</span><span class="nf">expand-file-name</span><span class="w"> </span><span class="s">"~/.emacs.d/org-config.org"</span><span class="p">))</span>
<span class="w">  </span><span class="p">(</span><span class="nf">org-babel-load-file</span><span class="w"> </span><span class="p">(</span><span class="nf">expand-file-name</span><span class="w"> </span><span class="s">"~/.emacs.d/emacs-init.org"</span><span class="p">))</span>

<span class="w">  </span><span class="p">(</span><span class="k">let</span><span class="w"> </span><span class="p">((</span><span class="nf">file-name</span><span class="w"> </span><span class="p">(</span><span class="nf">expand-file-name</span><span class="w"> </span><span class="s">"after-init.el"</span><span class="w"> </span><span class="nv">user-emacs-directory</span><span class="p">)))</span>
<span class="w">    </span><span class="p">(</span><span class="k">if</span><span class="w"> </span><span class="p">(</span><span class="nf">file-exists-p</span><span class="w"> </span><span class="nv">file-name</span><span class="p">)</span>
<span class="w">        </span><span class="p">(</span><span class="nf">load-file</span><span class="w"> </span><span class="nv">file-name</span><span class="p">)))</span>
</pre></div>

<p>
Now I just need to create the file and apply the fix:
</p>
<div class="highlight"><pre><span></span><span class="nb">echo</span><span class="w"> </span><span class="s2">"(setq package-check-signature nil)"</span><span class="w"> </span>&gt;&gt;<span class="w"> </span>./.emacs.d/config.el
</pre></div>
<p>
And since I can run custom code after loading the known configuration files I can set <code>elpy-rpc-virtualenv-path</code> variable in the same way:
</p>
<div class="highlight"><pre><span></span><span class="nb">echo</span><span class="w"> </span><span class="s2">"(setq elpy-rpc-virtualenv-path \"</span><span class="nv">$VIRTUAL_ENV</span><span class="s2">\")"</span><span class="w"> </span>&gt;&gt;<span class="w"> </span>./.emacs.d/after-init.el
</pre></div>

<p>
The Dockerfile code for this section is below:
</p>
<div class="highlight"><pre><span></span>RUN cd /root/ &amp;&amp; \
    git clone https://github.com/RePierre/.emacs.d.git .emacs.d &amp;&amp; \
    echo "(setq package-check-signature nil)" &gt;&gt; ./.emacs.d/config.el &amp;&amp; \
    sed -i '/^.*emacs-init.*$/d' ./.emacs.d/init.el &amp;&amp; \
    sed -i 's/(shell . t)/(sh . t)/' ./.emacs.d/common-config.org &amp;&amp; \
    sed -i '/^.*org-config.*$/d' ./.emacs.d/init.el &amp;&amp; \
    sed -i 's/\:defer\ t//' ./.emacs.d/python-config.org &amp;&amp; \
    echo "(setq elpy-rpc-virtualenv-path \"$VIRTUAL_ENV\")" &gt;&gt; ./.emacs.d/after-init.el
</pre></div>
<p>
It does one more thing not mentioned previously: a <code>sed</code> call to remove lazy loading of packages from <code>python-config.org</code> file.
</p>
</div>
</div>
