posts/python-ide-with-emacs-and-docker/index.org
* Issue #4: Using SSH keys to connect to GitHub
  Now that I have Emacs running on Ubuntu (albeit terminal only) I can enjoy a smooth workflow without having to wait too much for Magit or other application that took forever on Cygwin to finish.

  But there's an issue. I mount the repository I'm working on as a separate volume in the Docker container which allows =Magit= to read all required info (like user name etc.) directly from the repository. However, I cannot push changes to GitHub because I'm not authorized.

  To authorize the current container to push to GitHub I need to generate a pair of keys for the SSH authenthication on GitHub. But this can become, again, a maintenance chore: for each new container I need to create the keys, add them to my GitHub account and *remember to delete them when I'm finished with the container*.

  Instead of generating new keys each time, I decided to reuse the keys I already added to my GitHub account; the image I'm building will not leave my computer so there's no risk of someone getting ahold of my keys.

  I found how to do so easily: there's a StackOverflow [[https://stackoverflow.com/a/42125241/844006][answer]] for that. Summing it up is that you need to declare two build arguments that will hold the values for the private and public keys and write the values to their respective files. Of course, this implies creating the proper directories and assigning proper rights to the files. As an added bonus, the [[https://stackoverflow.com/a/42125241/844006][answer]] shows a way to add GitHub to the known hosts.  This is how it looks in the Dockerfile:
  #+begin_src sh
    ARG ssh_prv_key
    ARG ssh_pub_key

    RUN mkdir -p /root/.ssh && \
	chmod 0700 /root/.ssh && \
	ssh-keyscan github.com > /root/.ssh/known_hosts
  #+end_src

  To provide the values for the keys use =--build-arg= parameter when building your image like this:
  #+begin_src sh
    docker build -t <image-tag> \
	   --build-arg ssh_prv_key="$(cat ~/.ssh/id_rsa)" \
	   --build-arg ssh_pub_key="$(cat ~/.ssh/id_rsa.pub)" \
	   .
  #+end_src
* Issue #5: Install Emacs packages once and done
  After another build of the Docker image I started a container from it, logged in via ssh into the container, started Emacs and noticed yet another issue.

  The problem was that at each start of the container I had to wait for Emacs to download and install all the packages from the configuration files which, as you can guess may take a while.

  Since looking-up the answer on the Web did not return any meaningful results I started refining my question to the point where I came-up with the answer. Basically, when after several failed attempts I started typing in the search bar =how to load Emacs packages in background= I remembered reading somewhere that Emacs can be used in a client-server setup where the server runs in background.

  This is a feature of Emacs called [[https://www.emacswiki.org/emacs/EmacsAsDaemon][daemon mode]]. I have never used it myself but went on a whim and decided to try it just to see what would happen.

  So I changed my =Dockerfile= to start Emacs as a daemon:
  #+begin_src sh
    RUN emacs --daemon
  #+end_src
  And to my great surprise, when rebuilding the image I saw the output of Emacs packages being downloaded and installed.
* Issue #6: Terminal colors
  Being confident that everything should work now (it's the same setup I had on =WSL=) I started a new container to which I mounted the GitHub repo as a volume and got cracking.

  Everything went swell until I decided to commit the changes and invoked =magit-status=. Then I got a real eyesore: the colors of the text in the status buffer were making it really hard to understand what changed and where.

  At this point I just rage-quit and started looking for an answer. Fortunately, the right [[https://stackoverflow.com/a/64585/844006][StackOverflow answer]] popped up quickly and I applied the fix which just sets the =TERM= environment variable:
  #+begin_src sh
    ENV TERM=xterm-256color
  #+end_src

  And only after this, I was able to fully benefit from having the Python IDE I'm used to on a native platform.
