posts/python-ide-with-emacs-and-docker/index.html
<div id="outline-container-org1c0bc74" class="outline-2">
<h2 id="org1c0bc74">Issue #4: Using SSH keys to connect to GitHub</h2>
<div class="outline-text-2" id="text-org1c0bc74">
<p>
Now that I have Emacs running on Ubuntu (albeit terminal only) I can enjoy a smooth workflow without having to wait too much for Magit or other application that took forever on Cygwin to finish.
</p>

<p>
But there's an issue. I mount the repository I'm working on as a separate volume in the Docker container which allows <code>Magit</code> to read all required info (like user name etc.) directly from the repository. However, I cannot push changes to GitHub because I'm not authorized.
</p>

<p>
To authorize the current container to push to GitHub I need to generate a pair of keys for the SSH authentication on GitHub. But this can become, again, a maintenance chore: for each new container I need to create the keys, add them to my GitHub account and <b>remember to delete them when I'm finished with the container</b>.
</p>

<p>
Instead of generating new keys each time, I decided to reuse the keys I already added to my GitHub account; the image I'm building will not leave my computer so there's no risk of someone getting ahold of my keys.
</p>

<p>
I found how to do so easily: there's a StackOverflow <a href="https://stackoverflow.com/a/42125241/844006">answer</a> for that. Summing it up is that you need to declare two build arguments that will hold the values for the private and public keys and write the values to their respective files. Of course, this implies creating the proper directories and assigning proper rights to the files. As an added bonus, the <a href="https://stackoverflow.com/a/42125241/844006">answer</a> shows a way to add GitHub to the known hosts.  This is how it looks in the Dockerfile:
</p>
<div class="highlight"><pre><span></span><span class="w">  </span>ARG<span class="w"> </span>ssh_prv_key
<span class="w">  </span>ARG<span class="w"> </span>ssh_pub_key

<span class="w">  </span>RUN<span class="w"> </span>mkdir<span class="w"> </span>-p<span class="w"> </span>/root/.ssh<span class="w"> </span><span class="o">&amp;&amp;</span><span class="w"> </span><span class="se">\</span>
<span class="w">      </span>chmod<span class="w"> </span><span class="m">0700</span><span class="w"> </span>/root/.ssh<span class="w"> </span><span class="o">&amp;&amp;</span><span class="w"> </span><span class="se">\</span>
<span class="w">      </span>ssh-keyscan<span class="w"> </span>github.com<span class="w"> </span>&gt;<span class="w"> </span>/root/.ssh/known_hosts
</pre></div>

<p>
To provide the values for the keys use <code>--build-arg</code> parameter when building your image like this:
</p>
<div class="highlight"><pre><span></span><span class="w">  </span>docker<span class="w"> </span>build<span class="w"> </span>-t<span class="w"> </span>&lt;image-tag&gt;<span class="w"> </span><span class="se">\</span>
<span class="w">         </span>--build-arg<span class="w"> </span><span class="nv">ssh_prv_key</span><span class="o">=</span><span class="s2">"</span><span class="k">$(</span>cat<span class="w"> </span>~/.ssh/id_rsa<span class="k">)</span><span class="s2">"</span><span class="w"> </span><span class="se">\</span>
<span class="w">         </span>--build-arg<span class="w"> </span><span class="nv">ssh_pub_key</span><span class="o">=</span><span class="s2">"</span><span class="k">$(</span>cat<span class="w"> </span>~/.ssh/id_rsa.pub<span class="k">)</span><span class="s2">"</span><span class="w"> </span><span class="se">\</span>
<span class="w">         </span>.
</pre></div>
</div>
</div>
<div id="outline-container-orgf067b89" class="outline-2">
<h2 id="orgf067b89">Issue #5: Install Emacs packages once and done</h2>
<div class="outline-text-2" id="text-orgf067b89">
<p>
After another build of the Docker image I started a container from it, logged in via ssh into the container, started Emacs and noticed yet another issue.
</p>

<p>
The problem was that at each start of the container I had to wait for Emacs to download and install all the packages from the configuration files which, as you can guess may take a while.
</p>

<p>
Since looking-up the answer on the Web did not return any meaningful results I started refining my question to the point where I came-up with the answer. Basically, when after several failed attempts I started typing in the search bar <code>how to load Emacs packages in background</code> I remembered reading somewhere that Emacs can be used in a client-server setup where the server runs in background.
</p>

<p>
This is a feature of Emacs called <a href="https://www.emacswiki.org/emacs/EmacsAsDaemon">daemon mode</a>. I have never used it myself but went on a whim and decided to try it just to see what would happen.
</p>

<p>
So I changed my <code>Dockerfile</code> to start Emacs as a daemon:
</p>
<div class="highlight"><pre><span></span><span class="w">  </span>RUN<span class="w"> </span>emacs<span class="w"> </span>--daemon
</pre></div>
<p>
And to my great surprise, when rebuilding the image I saw the output of Emacs packages being downloaded and installed.
</p>
</div>
</div>
<div id="outline-container-orgf400a6d" class="outline-2">
<h2 id="orgf400a6d">Issue #6: Terminal colors</h2>
<div class="outline-text-2" id="text-orgf400a6d">
<p>
Being confident that everything should work now (it's the same setup I had on <code>WSL</code>) I started a new container to which I mounted the GitHub repo as a volume and got cracking.
</p>

<p>
Everything went swell until I decided to commit the changes and invoked <code>magit-status</code>. Then I got a real eyesore: the colors of the text in the status buffer were making it really hard to understand what changed and where.
</p>

<p>
At this point I just rage-quit and started looking for an answer. Fortunately, the right <a href="https://stackoverflow.com/a/64585/844006">StackOverflow answer</a> popped up quickly and I applied the fix which just sets the <code>TERM</code> environment variable:
</p>
<div class="highlight"><pre><span></span><span class="w">  </span>ENV<span class="w"> </span><span class="nv">TERM</span><span class="o">=</span>xterm-256color
</pre></div>

<p>
And only after this, I was able to fully benefit from having the Python IDE I'm used to on a native platform.
</p>
</div>
</div>
