posts/python-ide-with-emacs-and-docker/index.org
* TL;DR
  :PROPERTIES:
  :CUSTOM_ID: tldr
  :END:
The full Dockerfile described in this post is below:
#+begin_src sh
  FROM ubuntu:18.04

  RUN apt-get update && \
      apt-get install -y --no-install-recommends openssh-server tmux \
	      emacs emacs-goodies.el curl git \
	      python3 python3-pip python3-virtualenv python3-dev build-essential

  ARG password

  RUN mkdir /var/run/sshd
  RUN echo "root:${password}" | chpasswd
  RUN sed -i 's/#PermitRootLogin prohibit-password/PermitRootLogin yes/' /etc/ssh/sshd_config

  # SSH login fix. Otherwise user is kicked off after login
  RUN sed 's@session\s*required\s*pam_loginuid.so@session optional pam_loginuid.so@g' -i /etc/pam.d/sshd

  ENV NOTVISIBLE "in users profile"
  RUN echo "export VISIBLE=now" >> /etc/profile

  # From https://pythonspeed.com/articles/activate-virtualenv-dockerfile/
  ENV VIRTUAL_ENV=/opt/venv
  RUN python3 -m virtualenv --python=/usr/bin/python3 $VIRTUAL_ENV
  ENV PATH="$VIRTUAL_ENV/bin:$PATH"
  RUN pip install --upgrade pip setuptools wheel && \
      pip install numpy tensorflow scikit-learn gensim matplotlib pyyaml matplotlib-venn && \
      pip install elpy jedi rope yapf importmagic flake8 autopep8 black

  RUN cd /root/ && \
      git clone https://github.com/RePierre/.emacs.d.git .emacs.d && \
      echo "(setq package-check-signature nil)" >> ./.emacs.d/config.el && \
      sed -i '/^.*emacs-init.*$/d' ./.emacs.d/init.el && \
      sed -i 's/(shell . t)/(sh . t)/' ./.emacs.d/common-config.org && \
      sed -i '/^.*org-config.*$/d' ./.emacs.d/init.el && \
      sed -i 's/\:defer\ t//' ./.emacs.d/python-config.org && \
      echo "(setq elpy-rpc-virtualenv-path \"$VIRTUAL_ENV\")" >> ./.emacs.d/after-init.el

  # From https://stackoverflow.com/a/42125241/844006
  ARG ssh_prv_key
  ARG ssh_pub_key
  # Authorize SSH Host
  RUN mkdir -p /root/.ssh && \
      chmod 0700 /root/.ssh && \
      ssh-keyscan github.com > /root/.ssh/known_hosts

  # Add the keys and set permissions
  RUN echo "$ssh_prv_key" > /root/.ssh/id_rsa && \
      echo "$ssh_pub_key" > /root/.ssh/id_rsa.pub && \
      chmod 600 /root/.ssh/id_rsa && \
      chmod 600 /root/.ssh/id_rsa.pub

  RUN emacs --daemon

  # Set terminal colors https://stackoverflow.com/a/64585/844006
  ENV TERM=xterm-256color

  EXPOSE 22
  CMD ["/usr/sbin/sshd", "-D"]
#+end_src
To build the image use this command:
#+begin_src sh
  docker build -t <image-tag> \
	 --build-arg ssh_prv_key="$(cat ~/.ssh/id_rsa)" \
	 --build-arg ssh_pub_key="$(cat ~/.ssh/id_rsa.pub)" \
	 --build-arg password=<your-password-here> \
	 .
#+end_src
* Epilogue
  Looking back at this sort of quest of mine, I have nothing else to say than it was, overall, a fun experience.

  Sure, it also has some additional benefits that are important in my day-to-day life as a developer: I got a bit more experience in building =Docker= images and I /got to learn a big deal of stuff/. It is also worth noting that this setup did help me a lot in meeting the deadline, a fact which by itself states how much of an improvement this setup is (also taking in consideration the time I've spent to make it work).

  But the bottom line is that it was a great deal of fun involved which luckily resulted in a new tool in my shed --- while working on this post, I used this setup as the default for all new Python experiments and I will probably use it for future projects as well.
