posts/python-ide-with-emacs-and-docker/index.html
<div id="outline-container-tldr" class="outline-2">
<h2 id="tldr">TL;DR</h2>
<div class="outline-text-2" id="text-tldr">
<p>
The full Dockerfile described in this post is below:
</p>
<div class="highlight"><pre><span></span>FROM<span class="w"> </span>ubuntu:18.04

RUN<span class="w"> </span>apt-get<span class="w"> </span>update<span class="w"> </span><span class="o">&amp;&amp;</span><span class="w"> </span><span class="se">\</span>
<span class="w">    </span>apt-get<span class="w"> </span>install<span class="w"> </span>-y<span class="w"> </span>--no-install-recommends<span class="w"> </span>openssh-server<span class="w"> </span>tmux<span class="w"> </span><span class="se">\</span>
<span class="w">            </span>emacs<span class="w"> </span>emacs-goodies.el<span class="w"> </span>curl<span class="w"> </span>git<span class="w"> </span><span class="se">\</span>
<span class="w">            </span>python3<span class="w"> </span>python3-pip<span class="w"> </span>python3-virtualenv<span class="w"> </span>python3-dev<span class="w"> </span>build-essential

ARG<span class="w"> </span>password

RUN<span class="w"> </span>mkdir<span class="w"> </span>/var/run/sshd
RUN<span class="w"> </span><span class="nb">echo</span><span class="w"> </span><span class="s2">"root:</span><span class="si">${</span><span class="nv">password</span><span class="si">}</span><span class="s2">"</span><span class="w"> </span><span class="p">|</span><span class="w"> </span>chpasswd
RUN<span class="w"> </span>sed<span class="w"> </span>-i<span class="w"> </span><span class="s1">'s/#PermitRootLogin prohibit-password/PermitRootLogin yes/'</span><span class="w"> </span>/etc/ssh/sshd_config

<span class="c1"># SSH login fix. Otherwise user is kicked off after login</span>
RUN<span class="w"> </span>sed<span class="w"> </span><span class="s1">'s@session\s*required\s*pam_loginuid.so@session optional pam_loginuid.so@g'</span><span class="w"> </span>-i<span class="w"> </span>/etc/pam.d/sshd

ENV<span class="w"> </span>NOTVISIBLE<span class="w"> </span><span class="s2">"in users profile"</span>
RUN<span class="w"> </span><span class="nb">echo</span><span class="w"> </span><span class="s2">"export VISIBLE=now"</span><span class="w"> </span>&gt;&gt;<span class="w"> </span>/etc/profile

<span class="c1"># From https://pythonspeed.com/articles/activate-virtualenv-dockerfile/</span>
ENV<span class="w"> </span><span class="nv">VIRTUAL_ENV</span><span class="o">=</span>/opt/venv
RUN<span class="w"> </span>python3<span class="w"> </span>-m<span class="w"> </span>virtualenv<span class="w"> </span>--python<span class="o">=</span>/usr/bin/python3<span class="w"> </span><span class="nv">$VIRTUAL_ENV</span>
ENV<span class="w"> </span><span class="nv">PATH</span><span class="o">=</span><span class="s2">"</span><span class="nv">$VIRTUAL_ENV</span><span class="s2">/bin:</span><span class="nv">$PATH</span><span class="s2">"</span>
RUN<span class="w"> </span>pip<span class="w"> </span>install<span class="w"> </span>--upgrade<span class="w"> </span>pip<span class="w"> </span>setuptools<span class="w"> </span>wheel<span class="w"> </span><span class="o">&amp;&amp;</span><span class="w"> </span><span class="se">\</span>
<span class="w">    </span>pip<span class="w"> </span>install<span class="w"> </span>numpy<span class="w"> </span>tensorflow<span class="w"> </span>scikit-learn<span class="w"> </span>gensim<span class="w"> </span>matplotlib<span class="w"> </span>pyyaml<span class="w"> </span>matplotlib-venn<span class="w"> </span><span class="o">&amp;&amp;</span><span class="w"> </span><span class="se">\</span>
<span class="w">    </span>pip<span class="w"> </span>install<span class="w"> </span>elpy<span class="w"> </span>jedi<span class="w"> </span>rope<span class="w"> </span>yapf<span class="w"> </span>importmagic<span class="w"> </span>flake8<span class="w"> </span>autopep8<span class="w"> </span>black

RUN<span class="w"> </span><span class="nb">cd</span><span class="w"> </span>/root/<span class="w"> </span><span class="o">&amp;&amp;</span><span class="w"> </span><span class="se">\</span>
<span class="w">    </span>git<span class="w"> </span>clone<span class="w"> </span>https://github.com/RePierre/.emacs.d.git<span class="w"> </span>.emacs.d<span class="w"> </span><span class="o">&amp;&amp;</span><span class="w"> </span><span class="se">\</span>
<span class="w">    </span><span class="nb">echo</span><span class="w"> </span><span class="s2">"(setq package-check-signature nil)"</span><span class="w"> </span>&gt;&gt;<span class="w"> </span>./.emacs.d/config.el<span class="w"> </span><span class="o">&amp;&amp;</span><span class="w"> </span><span class="se">\</span>
<span class="w">    </span>sed<span class="w"> </span>-i<span class="w"> </span><span class="s1">'/^.*emacs-init.*$/d'</span><span class="w"> </span>./.emacs.d/init.el<span class="w"> </span><span class="o">&amp;&amp;</span><span class="w"> </span><span class="se">\</span>
<span class="w">    </span>sed<span class="w"> </span>-i<span class="w"> </span><span class="s1">'s/(shell . t)/(sh . t)/'</span><span class="w"> </span>./.emacs.d/common-config.org<span class="w"> </span><span class="o">&amp;&amp;</span><span class="w"> </span><span class="se">\</span>
<span class="w">    </span>sed<span class="w"> </span>-i<span class="w"> </span><span class="s1">'/^.*org-config.*$/d'</span><span class="w"> </span>./.emacs.d/init.el<span class="w"> </span><span class="o">&amp;&amp;</span><span class="w"> </span><span class="se">\</span>
<span class="w">    </span>sed<span class="w"> </span>-i<span class="w"> </span><span class="s1">'s/\:defer\ t//'</span><span class="w"> </span>./.emacs.d/python-config.org<span class="w"> </span><span class="o">&amp;&amp;</span><span class="w"> </span><span class="se">\</span>
<span class="w">    </span><span class="nb">echo</span><span class="w"> </span><span class="s2">"(setq elpy-rpc-virtualenv-path \"</span><span class="nv">$VIRTUAL_ENV</span><span class="s2">\")"</span><span class="w"> </span>&gt;&gt;<span class="w"> </span>./.emacs.d/after-init.el

<span class="c1"># From https://stackoverflow.com/a/42125241/844006</span>
ARG<span class="w"> </span>ssh_prv_key
ARG<span class="w"> </span>ssh_pub_key
<span class="c1"># Authorize SSH Host</span>
RUN<span class="w"> </span>mkdir<span class="w"> </span>-p<span class="w"> </span>/root/.ssh<span class="w"> </span><span class="o">&amp;&amp;</span><span class="w"> </span><span class="se">\</span>
<span class="w">    </span>chmod<span class="w"> </span><span class="m">0700</span><span class="w"> </span>/root/.ssh<span class="w"> </span><span class="o">&amp;&amp;</span><span class="w"> </span><span class="se">\</span>
<span class="w">    </span>ssh-keyscan<span class="w"> </span>github.com<span class="w"> </span>&gt;<span class="w"> </span>/root/.ssh/known_hosts

<span class="c1"># Add the keys and set permissions</span>
RUN<span class="w"> </span><span class="nb">echo</span><span class="w"> </span><span class="s2">"</span><span class="nv">$ssh_prv_key</span><span class="s2">"</span><span class="w"> </span>&gt;<span class="w"> </span>/root/.ssh/id_rsa<span class="w"> </span><span class="o">&amp;&amp;</span><span class="w"> </span><span class="se">\</span>
<span class="w">    </span><span class="nb">echo</span><span class="w"> </span><span class="s2">"</span><span class="nv">$ssh_pub_key</span><span class="s2">"</span><span class="w"> </span>&gt;<span class="w"> </span>/root/.ssh/id_rsa.pub<span class="w"> </span><span class="o">&amp;&amp;</span><span class="w"> </span><span class="se">\</span>
<span class="w">    </span>chmod<span class="w"> </span><span class="m">600</span><span class="w"> </span>/root/.ssh/id_rsa<span class="w"> </span><span class="o">&amp;&amp;</span><span class="w"> </span><span class="se">\</span>
<span class="w">    </span>chmod<span class="w"> </span><span class="m">600</span><span class="w"> </span>/root/.ssh/id_rsa.pub

RUN<span class="w"> </span>emacs<span class="w"> </span>--daemon

<span class="c1"># Set terminal colors https://stackoverflow.com/a/64585/844006</span>
ENV<span class="w"> </span><span class="nv">TERM</span><span class="o">=</span>xterm-256color

EXPOSE<span class="w"> </span><span class="m">22</span>
CMD<span class="w"> </span><span class="o">[</span><span class="s2">"/usr/sbin/sshd"</span>,<span class="w"> </span><span class="s2">"-D"</span><span class="o">]</span>
</pre></div>
<p>
To build the image use this command:
</p>
<div class="highlight"><pre><span></span>docker<span class="w"> </span>build<span class="w"> </span>-t<span class="w"> </span>&lt;image-tag&gt;<span class="w"> </span><span class="se">\</span>
<span class="w">       </span>--build-arg<span class="w"> </span><span class="nv">ssh_prv_key</span><span class="o">=</span><span class="s2">"</span><span class="k">$(</span>cat<span class="w"> </span>~/.ssh/id_rsa<span class="k">)</span><span class="s2">"</span><span class="w"> </span><span class="se">\</span>
<span class="w">       </span>--build-arg<span class="w"> </span><span class="nv">ssh_pub_key</span><span class="o">=</span><span class="s2">"</span><span class="k">$(</span>cat<span class="w"> </span>~/.ssh/id_rsa.pub<span class="k">)</span><span class="s2">"</span><span class="w"> </span><span class="se">\</span>
<span class="w">       </span>--build-arg<span class="w"> </span><span class="nv">password</span><span class="o">=</span>&lt;your-password-here&gt;<span class="w"> </span><span class="se">\</span>
<span class="w">       </span>.
</pre></div>
</div>
</div>
<div id="outline-container-org33f8426" class="outline-2">
<h2 id="org33f8426">Epilogue</h2>
<div class="outline-text-2" id="text-org33f8426">
<p>
Looking back at this sort of quest of mine, I have nothing else to say than it was, overall, a fun experience.
</p>

<p>
Sure, it also has some additional benefits that are important in my day-to-day life as a developer: I got a bit more experience in building <code>Docker</code> images and I <i>got to learn a big deal of stuff</i>. It is also worth noting that this setup did help me a lot in meeting the deadline, a fact which by itself states how much of an improvement this setup is (also taking in consideration the time I've spent to make it work).
</p>

<p>
But the bottom line is that it was a great deal of fun involved which luckily resulted in a new tool in my shed — while working on this post, I used this setup as the default for all new Python experiments and I will probably use it for future projects as well.
</p>
</div>
</div>
